#ifndef _PKCS11_NG_H_
#define _PKCS11_NG_H_

// идентификаторы механизмов для новых ГОСТ 2012
#define CKM_GOSTR3411_12_256				0x80504330
#define CKM_GOSTR3411_12_512				0x80504331
#define CKM_GOSTR3411_12_256_HMAC			0x80504332
#define CKM_GOSTR3411_12_512_HMAC			0x80504333
#define CKM_GOSTR3410_512_KEY_PAIR_GEN		0x80504326
#define CKM_GOSTR3410_512					0x80504327
#define CKM_GOSTR3410_512_DERIVE			0x80504328
#define CKM_GOSTR3410_512_KEY_WRAP			0x80504329

// нужно добавить механизм смешанного вычисления подписи
#define CKM_GOSTR3410_512_WITH_GOSTR3411_512	0x80504334

// тип ключа для ГОСТ Р 34.10-2012 длиной 512 бит
#define CKK_GOSTR3410_512					0x80504303

// определения OID для алгоритмов ГОСТ 2012
#define OID_SIGN2012_KEY256					"1.2.643.7.1.1.1.1"	// подпись с ключом 256
#define OID_SIGN2012_KEY512					"1.2.643.7.1.1.1.2"	// подпись с ключом 512
#define OID_HASH2012_LEN256					"1.2.643.7.1.1.2.2"	// хеш с длиной 256 бит
#define OID_HASH2012_LEN512					"1.2.643.7.1.1.2.3"	// хеш с длиной 512 бит
#define OID_SIGN2012_AND_HASH2012_KEY256	"1.2.643.7.1.1.3.2"	// подпись с ключом 256 бит + хеш 2012
#define OID_SIGN2012_AND_HASH2012_KEY256	"1.2.643.7.1.1.3.3"	// алгоритм подписи ГОСТ Р 34.10-12 с ключом 512 с  хэшированием ГОСТ Р 34.11-12
#define OID_HMAC2012_LEN256					"1.2.643.7.1.1.4.1"	// алгоритм HMAC на основе ГОСТ Р 34.11-12 с ключом  256 со значениями B = 64, L = 32
#define OID_HMAC2012_LEN512					"1.2.643.7.1.1.4.2"	// алгоритм HMAC на основе ГОСТ Р 34.11-12 с ключом 512 со значениями B = 64, L = 64
#define OID_GOST2012_DH_KEY256				"1.2.643.7.1.1.6.1"	// алгоритмы согласования ключа на основе ГОСТ Р 34.10- 12 для ключа 256
#define OID_GOST2012_DH_KEY512				"1.2.643.7.1.1.6.2"	// алгоритмы согласования ключа на основе ГОСТ Р 34.10-12 для ключа 512
// параметры для алгоритмов ГОСТ 2012
#define OID_SIGN2012_PARAM_TEST				"1.2.643.7.1.2.1.2.0"	// тестовые параметры алгоритма подписи ГОСТ Р 34.10- 12 с ключом 512
#define OID_SIGN2012_PARAM_A				"1.2.643.7.1.2.1.2.1"	// рабочие параметры алгоритма подписи ГОСТ Р 34.10-12 с ключом 512 
#define OID_SIGN2012_PARAM_B				"1.2.643.7.1.2.1.2.2"	// рабочие параметры алгоритма подписи ГОСТ Р 34.10-12 с ключом 512           

#endif